//
//  YKKeyMap.m
//  YKSimulatorTouch
//
//  Created by xiaobin liu on 2024/6/14.
//  参考https://github.com/apple-oss-distributions/IOHIDFamily

#import "YKKeyMap.h"


// 定义键盘映射结构体
typedef struct {
    NSString *key;
    int code;
} Key;


// 定义键盘映射数组
static const Key KeyMap[] = {
    {@"A", 4},                 //A
    {@"B", 5},                 //B
    {@"C", 6},                 //C
    {@"D", 7},                 //D
    {@"E", 8},                 //E
    {@"F", 9},                 //F
    {@"G", 10},                //G
    {@"H", 11},                //H
    {@"I", 12},                //I
    {@"J", 13},                //J
    {@"K", 14},                //K
    {@"L", 15},                //L
    {@"M", 16},                //M
    {@"N", 17},                //N
    {@"O", 18},                //O
    {@"P", 19},                //P
    {@"Q", 20},                //Q
    {@"R", 21},                //R
    {@"S", 22},                //S
    {@"T", 23},                //T
    {@"U", 24},                //U
    {@"V", 25},                //V
    {@"W", 26},                //W
    {@"X", 27},                //X
    {@"Y", 28},                //Y
    {@"Z", 29},                //Z
    {@"1", 30},                //1
    {@"2", 31},                //2
    {@"3", 32},                //3
    {@"4", 33},                //4
    {@"5", 34},                //5
    {@"6", 35},                //6
    {@"7", 36},                //7
    {@"8", 37},                //8
    {@"9", 38},                //9
    {@"0", 39},                //0
    {@"enter", 40},            //回车键 或 Enter
    {@"esc", 41},              //Escape 键
    {@"backspace", 42},        //除键 或 回退键(删除光标左侧（向后删除）字符)
    {@"tab", 43},              //Tab 键
    {@"space", 44},            //空格键
    {@"-", 45},                //连字符 或 下划线（连字符 (Hyphen)：通常指键盘上的 - 键。下划线 (Underscore)：按住 Shift 键再按 - 键会输入下划线 _）
    {@"=", 46},                //等号 或 加号
    {@"[", 47},                //开方括号 或 开大括号
    {@"]",48},                 //闭方括号 或 闭大括号
    {@"\\", 49},               //反斜杠 或 垂直线
    {@"NonUSPound", 50},       //非美国键盘的 # 键 或下划线
    {@";", 51},                //分号 或 冒号
    {@"'", 52},                //单引号 或 双引号
    {@"`", 53},                //重音符号 和 波浪线
    {@",", 54},                //逗号 或 小于号
    {@".",55},                 //句点 或 大于号
    {@"/",56},                 //斜杠 或 问号
    {@"CapsLock",57},          //大写锁定键(有限制，就是看你键盘类型，所以最好你还是用Shift + a)
    {@"F1", 58},               //F1
    {@"F2", 59},               //F2
    {@"F3", 60},               //F3
    {@"F4", 61},               //F4
    {@"F5", 62},               //F5
    {@"F6", 63},               //F6
    {@"F7", 64},               //F7
    {@"F8", 65},               //F8
    {@"F9", 66},               //F9
    {@"F10", 67},              //F10
    {@"F11", 68},              //F11
    {@"F12", 69},              //F12
    {@"PrintScreen", 70},      //打印屏幕键
    {@"ScrollLock", 71},       //滚动锁定键
    {@"Pause", 72},            //暂停键
    {@"Insert", 73},           //插入键
    {@"Home", 74},             //首页键(Keyboard无用, 直接转换到kHIDPage_Consumer               = 0x0C,    /* 消费者设备（音量调节等） */)
    {@"PageUp", 75},           //上一页键
    {@"del", 76},              //删除键(删除光标右侧（向前删除）字符)
    {@"End", 77},              //结束键
    {@"PageDown", 78},         //下一页键
    {@"dpadright",79},         //右箭头键
    {@"dpadleft", 80},         //左箭头键
    {@"dpaddown", 81},         //下箭头键
    {@"dpadup", 82},           //上箭头键
    {@"NumLock", 83},          //小键盘数字锁定 或 清除
    {@"KeypadSlash",84},       //小键盘 / 键
    {@"KeypadAsterisk",85},    //小键盘 * 键
    {@"KeypadHyphen", 86},     //小键盘 - 键
    {@"KeypadPlus",87},        //小键盘 + 键
    {@"KeypadEnter", 88},      //小键盘回车键
    {@"Keypad1", 89},          //小键盘 1 键
    {@"Keypad2", 90},          //小键盘 2 键
    {@"Keypad3", 91},          //小键盘 3 键
    {@"Keypad4", 92},          //小键盘 4 键
    {@"Keypad5", 93},          //小键盘 5 键
    {@"Keypad6", 94},          //小键盘 6 键
    {@"Keypad7", 95},          //小键盘 7 键
    {@"Keypad8", 96},          //小键盘 8 键
    {@"Keypad9", 97},          //小键盘 9 键
    {@"Keypad0", 98},          //小键盘 0 键
    {@"KeypadPeriod", 99},     //小键盘 . 键
    {@"NonUSBackslash", 100},  //非美国的反斜杠 \ 或竖线 |
    {@"Application", 101},     //应用程序
    {@"Power", 102},           //电源
    {@"KeypadEqualSign", 103}, //小键盘上的 = 键
    {@"F13", 104},             //F13
    {@"F14", 105},             //F14
    {@"F15", 106},             //F15
    {@"F16", 107},             //F16
    {@"F17", 108},             //F16
    {@"F18", 109},             //F18
    {@"F19", 110},             //F19
    {@"F20", 111},             //F20
    {@"F21", 112},             //F21
    {@"F22", 113},             //F22
    {@"F23", 114},             //F23
    {@"F24", 115},             //F24
    {@"Execute", 116},         //执行
    {@"Help", 117},            //帮助
    {@"Menu", 118},            //菜单
    {@"Select", 119},          //选择
    {@"Stop", 120},            //停止
    {@"Again", 121},           //再次
    {@"Undo", 122},            //撤销
    {@"Cut", 123},             //剪切
    {@"Copy", 124},            //复制
    {@"Paste", 125},           //粘贴
    {@"Find", 126},            //查找
    {@"Mute", 127},            //静音(iPhone上不支持，mac，才支持，用另外一套处理)
    {@"VolumeUp", 128},        //音量增大(iPhone上不支持，mac，才支持，用另外一套处理)
    {@"VolumeDown", 129},      //音量减小(iPhone上不支持，mac，才支持，用另外一套处理)
    {@"LockingCapsLock",130},  //锁定大写锁定(iPhone上不支持，mac，ipad，才支持)
    {@"LockingNumLock",131},   //锁定数字锁定(iPhone上不支持，mac，ipad，才支持)
    {@"LockingScrollLock",132},//锁定滚动锁定(iPhone上不支持，mac，ipad，才支持)
    {@"KeypadComma", 133},     //小键盘逗号键
    {@"SignAS400", 134},       //AS/400 键盘等号键(不常用)
    {@"International1", 135},  //国际化键1
    {@"International2", 136},  //国际化键2
    {@"International3", 137},  //国际化键3
    {@"International4", 138},  //国际化键4
    {@"International5", 139},  //国际化键5
    {@"International6", 140},  //国际化键6
    {@"International7", 141},  //国际化键7
    {@"International8", 142},  //国际化键8
    {@"International9", 143},  //国际化键9
    {@"LANG1", 144},           //语言1
    {@"LANG2", 145},           //语言2
    {@"LANG3", 146},           //语言3
    {@"LANG4", 147},           //语言4
    {@"LANG5", 148},           //语言5
    {@"LANG6", 149},           //语言6
    {@"LANG7", 150},           //语言7
    {@"LANG8", 151},           //语言8
    {@"LANG9", 152},           //语言9
    {@"AlternateErase", 153},  //替代删除
    {@"SysReqOrAttention",154},//系统请求或注意
    {@"Cancel", 155},          //取消
    {@"Clear", 156},           //清除
    {@"Prior", 157},           //上一项
    {@"Return", 158},          //回车
    {@"Separator", 159},       //分隔符
    {@"Out", 160},             //输出
    {@"Oper", 161},            //操作
    {@"ClearOrAgain ", 162},   //清除/再次
    {@"CrSelOrProps ", 163},   //创建选择/属性键
    {@"ExSel ", 164},          //扩展选择键
    {@"LeftControl", 224},     //左控制键
    {@"shiftleft", 225},       //左Shift键
    {@"LeftAlt", 226},         //左Alt键
    {@"LeftGUI", 227},         //左GUI键 (左Windows键"，通常也称为 "右操作系统)
    {@"RightControl", 228},    //右控制键
    {@"shiftright", 229},      //右Shift键
    {@"RightAlt", 230},        //右Alt键
    {@"RightGUI", 231},        //右GUI键 (右Windows键"，通常也称为 "右操作系统)
    
    
    {@"HOME", 300},            //Home
    {@"MUTE", 301},            //静音键
    {@"POWER", 302},           //锁屏键
    {@"VOLUP", 303},           //音量+
    {@"VOLDOWN", 304},         //音量-
};

@implementation YKKeyMap

+(int)getCode:(NSString *)key {
    
    // 遍历 KeyMap 数组，查找与给定键相匹配的代码
    for (int i = 0; i < sizeof(KeyMap) / sizeof(Key); i++) {
        Key mapKey = KeyMap[i];
        if ([[mapKey.key uppercaseString] isEqualToString:key]) {
            return mapKey.code;
        }
    }
    return -1; // 如果未找到匹配的键，则返回 -1
}


#pragma mark - 键盘映射
+(NSDictionary *)keyboardKeyMap {
    
    static NSDictionary *keyMap = nil;
    static dispatch_once_t onceToken;
    dispatch_once(&onceToken, ^{
        keyMap = @{
            @"a": @[@4],
            @"b": @[@5],
            @"c": @[@6],
            @"d": @[@7],
            @"e": @[@8],
            @"f": @[@9],
            @"g": @[@10],
            @"h": @[@11],
            @"i": @[@12],
            @"j": @[@13],
            @"k": @[@14],
            @"l": @[@15],
            @"m": @[@16],
            @"n": @[@17],
            @"o": @[@18],
            @"p": @[@19],
            @"q": @[@20],
            @"r": @[@21],
            @"s": @[@22],
            @"t": @[@23],
            @"u": @[@24],
            @"v": @[@25],
            @"w": @[@26],
            @"x": @[@27],
            @"y": @[@28],
            @"z": @[@29],
            @"1": @[@30],
            @"2": @[@31],
            @"3": @[@32],
            @"4": @[@33],
            @"5": @[@34],
            @"6": @[@35],
            @"7": @[@36],
            @"8": @[@37],
            @"9": @[@38],
            @"0": @[@39],
            @"Return": @[@40],
            @"Enter": @[@40],
            @"Num+Enter": @[@40],
            @"Space": @[@44],
            @"Escape":@[@41],
            @"Backspace" : @[@42],
            @"Tab": @[@43],
            @" " : @[@44],
            @"-" : @[@45],
            @"=" : @[@46],
            @"[": @[@47],
            @"]": @[@48],
            @"\\": @[@49],
            @";": @[@51],
            @"'": @[@52],
            @"`": @[@53],
            @",": @[@54],
            @".": @[@55],
            @"/": @[@56],
            @"*": @[@225, @37],
            @"+" : @[@225, @46],
            @"CapsLock": @[@57],
            @"A": @[@225, @4],
            @"B": @[@225, @5],
            @"C": @[@225, @6],
            @"D": @[@225, @7],
            @"E": @[@225, @8],
            @"F": @[@225, @9],
            @"G": @[@225, @10],
            @"H": @[@225, @11],
            @"I": @[@225, @12],
            @"J": @[@225, @13],
            @"K": @[@225, @14],
            @"L": @[@225, @15],
            @"M": @[@225, @16],
            @"N": @[@225, @17],
            @"O": @[@225, @18],
            @"P": @[@225, @19],
            @"Q": @[@225, @20],
            @"R": @[@225, @21],
            @"S": @[@225, @22],
            @"T": @[@225, @23],
            @"U": @[@225, @24],
            @"V": @[@225, @25],
            @"W": @[@225, @26],
            @"X": @[@225, @27],
            @"Y": @[@225, @28],
            @"Z": @[@225, @29],
            @"Shift+1" : @[@225, @30],
            @"Shift+2" : @[@225, @31],
            @"Shift+3" : @[@225, @32],
            @"Shift+4" : @[@225, @33],
            @"Shift+5" : @[@225, @34],
            @"Shift+6" : @[@225, @35],
            @"Shift+7" : @[@225, @36],
            @"Shift+8" : @[@225, @37],
            @"Shift+9" : @[@225, @38],
            @"Shift+0" : @[@225, @39],
            @"Shift+=" : @[@225, @46],
            @"Shift+-" : @[@225, @45],
            @"Shift+[": @[@225, @47],
            @"Shift+]": @[@225, @48],
            @"Shift+\\": @[@225, @49],
            @"Shift+;": @[@225, @51],
            @"Shift+'": @[@225, @52],
            @"Shift+`": @[@225, @53],
            @"Shift+,": @[@225, @54],
            @"Shift+.": @[@225, @55],
            @"Shift+/": @[@225, @56],
            @"Del": @[@76],
            @"Right": @[@79],
            @"Left": @[@80],
            @"Down": @[@81],
            @"Up": @[@82],
            @"Num+Right": @[@79],
            @"Num+Left": @[@80],
            @"Num+Down": @[@81],
            @"Num+Up": @[@82],
            @"Shift+Return":@[@229, @40],
            @"Shift+Enter": @[@229, @40],
            @"Shift+Right": @[@229, @79],
            @"Shift+Left": @[@229, @80],
            @"Shift+Down": @[@229, @81],
            @"Shift+Up": @[@229, @82],
            @"Shift+Num+Right": @[@229, @79],
            @"Shift+Num+Left": @[@229, @80],
            @"Shift+Num+Down": @[@229, @81],
            @"Shift+Num+Up": @[@229, @82],
            @"Ctrl+A": @[@227, @4],
            @"Ctrl+C": @[@227, @6],
            @"Ctrl+X": @[@227, @27],
            @"Ctrl+Z": @[@227, @29],
            @"Ctrl+Y": @[@229, @227, @29],
            @"Ctrl+Shift+Z":@[@229, @227, @29],
            @"Ctrl+Space": @[@224, @44],
            @"Ctrl+Shift+": @[@224, @44],
        };
    });
    return keyMap;
}

#pragma mark - 中文映射
+(NSDictionary *)chineseKeyMap {
    
    static NSDictionary *keyMap = nil;
    static dispatch_once_t onceToken;
    dispatch_once(&onceToken, ^{
        keyMap = @{
            @"`": @"·",
            @"\\": @"、",
            @"[": @"【",
            @"]": @"】",
            @";": @"；",
            @"'": @"‘",
            @",": @"，",
            @".": @"。",
            @"Shift+`": @"～",
            @"Shift+1": @"！",
            @"Shift+4": @"¥",
            @"Shift+6": @"……",
            @"Shift+9": @"（",
            @"Shift+0": @"）",
            @"Shift+-": @"——",
            @"Shift+|": @"｜",
            @"Shift+[": @"「",
            @"Shift+]": @"」",
            @"Shift+'": @"“",
            @"Shift+;": @"：",
            @"Shift+,": @"《",
            @"Shift+.": @"》",
            @"Shift+/": @"?",
        };
    });
    return keyMap;
}

@end
